#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-Q1s8C1AH8K68vvCh

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=138795791]
module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns: Refreshing state... [id=138795789]
module.infrastructure.module.elasticsearch.digitalocean_record.elastic_subdomain_dns: Refreshing state... [id=138795790]
module.infrastructure.module.database.digitalocean_database_cluster.api_db: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65]
module.infrastructure.digitalocean_domain.fluentlabs: Refreshing state... [id=fluentlabs.io]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate_fluent_labs: Refreshing state... [id=5a8b4843-0d50-0f47-e2db-9a7d0d0d208a]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=0f42c40a-e36f-4ce4-ead6-45bb4326ec27]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=fluentlabs-content]
module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch: Refreshing state... [id=elasticsearch]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.aws_s3_bucket.backup: Refreshing state... [id=fluentlabs-elasticsearch-backups]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket.main: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSERLYTV5P]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIASM4ZEOVSADUQ77GK]
module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch: Refreshing state... [id=AKIASM4ZEOVSI6VLF73T]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIASM4ZEOVSEBHLP4HO]
module.infrastructure.module.frontend_preprod.aws_s3_bucket.main: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.database.digitalocean_database_firewall.allow_kubernetes: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65-20210110103039465500000001]
module.infrastructure.module.api.digitalocean_database_user.api_user: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/user/api-default]
module.infrastructure.module.api.digitalocean_database_db.api_database: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/database/foreign-language-reader-default]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/fluentlabs-ingress]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials: Refreshing state... [id=default/elasticsearch-s3-creds]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.monitoring.helm_release.sematext_logagent: Refreshing state... [id=sematext]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.frontend_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.fluentlabs.io]
module.infrastructure.module.frontend_preprod_fluent_labs.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.fluentlabs.io]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-write-role]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::165140526436:policy/spark-read-role]
module.infrastructure.module.elasticsearch.elasticsearch_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup: Refreshing state... [id=arn:aws:iam::165140526436:policy/elasticsearch-backup-role]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups: Refreshing state... [id=S3-backup]
module.infrastructure.module.elasticsearch.elasticsearch_user.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.elasticsearch_user.api: Refreshing state... [id=apiprod]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_lifecycle_policy.daily_backup: Refreshing state... [id=daily-snapshots]
module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup: Refreshing state... [id=elasticsearch-backup-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_index_lifecycle_policy.rollover: Refreshing state... [id=logging-rollover]
module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd: Refreshing state... [id=fluentd]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
        id             = "2132b4c2-fd9e-496c-8419-a39da7d142f0"
        name           = "foreign-language-reader"
      ~ surge_upgrade  = false -> true
        tags           = [
            "prod",
        ]
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.acme_certificate.certificate will be updated in-place
  ~ resource "acme_certificate" "certificate" {
      ~ certificate_domain           = "*.foreignlanguagereader.com" -> (known after apply)
      ~ certificate_p12              = (sensitive value)
      ~ certificate_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFPTCCBCWgAwIBAgISBHP8PN2vFGHHjr8Vzl0DTcgIMA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yMTAyMjUwNDI1MDNaFw0yMTA1MjYwNDI1MDNaMCYxJDAiBgNVBAMM
            GyouZm9yZWlnbmxhbmd1YWdlcmVhZGVyLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOJeP5miwkqKVFZTEL75JU+4qc/KECQ3+HdNTCD16DnOQi1n
            qdC/8CJmpD/3OY+dDbzgjPeYDUAHb9YLXaOc0Rewo7gFRygks5CTSUbgy5cLseCw
            NSLckVB3rrt2q9V+cBQHUyltIm/6LC2xXLFDi5KVPx++N0qhvPbPefG5nWq/VpWC
            hq5c6kpI80Wez0EL+9pBODwtU1wHx21q3Ys2KtLo/5ihUR9aRMaTUlRxiv6igleH
            bFVSbX9RYDNIMpiNMFUMkMFEkH55T6aIPZGhILRS/no4oToXRjJlr9b686yws/dS
            n2iHCT37eRFesz9u3kD9ZRUdE1Gzn4oYGlqZkycCAwEAAaOCAlcwggJTMA4GA1Ud
            DwEB/wQEAwIFoDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0T
            AQH/BAIwADAdBgNVHQ4EFgQUlaRsI3FHN3cg5QGlKwgF2thizlswHwYDVR0jBBgw
            FoAUFC6zF7dYVsuuUAlA5h+vnYsUwsYwVQYIKwYBBQUHAQEESTBHMCEGCCsGAQUF
            BzABhhVodHRwOi8vcjMuby5sZW5jci5vcmcwIgYIKwYBBQUHMAKGFmh0dHA6Ly9y
            My5pLmxlbmNyLm9yZy8wJgYDVR0RBB8wHYIbKi5mb3JlaWdubGFuZ3VhZ2VyZWFk
            ZXIuY29tMEwGA1UdIARFMEMwCAYGZ4EMAQIBMDcGCysGAQQBgt8TAQEBMCgwJgYI
            KwYBBQUHAgEWGmh0dHA6Ly9jcHMubGV0c2VuY3J5cHQub3JnMIIBBQYKKwYBBAHW
            eQIEAgSB9gSB8wDxAHcARJRlLrDuzq/EQAfYqP4owNrmgr7YyzG1P9MzlrW2gagA
            AAF316XPuQAABAMASDBGAiEA5snDxJhCndqk7fug68ozLtPZvQxitXwLhkSLijJp
            rGYCIQD4ZvtTKmle5UC4ZuqRE95QjvOs2D4jkTugCRYjOXcSfQB2AH0+8viP/4hV
            aCTCwMqeUol5K8UOeAl/LmqXaJl+IvDXAAABd9elz+UAAAQDAEcwRQIhAL1bj+aI
            tURHqEjMt2065Ws1jIY4i109riJ2CxfUge2mAiBYfgketZrzsUN7g1S+po/j3PTk
            wlCHxfKPDG6aiPqFpzANBgkqhkiG9w0BAQsFAAOCAQEAjz+V0v6svA1ufL0SYODk
            407DwjJ+77V/eYG2RT20FlNsy+bjQ/JXoNSppP3Z4bImUKCgoXljsucaGgqfS2k9
            vQmXVbn7go93hoKtGZ7trN319vw747PJ86bsAxLEwl77aqQrvUk7dpp5GPnyKOCF
            KAnvZw0r1DhkbAqdBfWxEEz8ib1S4BEoLW49YhPo6WSqfeBtf5laSEYCqJr3NXkl
            A0fiAuKt3bIZ6TDsL4RI1Ucz7zi+osSEmvBrxm0nxaLUbgTSaysLBDBxAKetAPw6
            TAy9bXJppFAjAETGrYA3odfaN+ZJW4J+S9dHSOLsglQVQTzuGZ1y45gvZs6CAZBC
            7g==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ certificate_url              = "https://acme-v02.api.letsencrypt.org/acme/cert/0473fc3cddaf1461c78ebf15ce5d034dc808" -> (known after apply)
        id                           = "0f42c40a-e36f-4ce4-ead6-45bb4326ec27"
      ~ issuer_pem                   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEZTCCA02gAwIBAgIQQAF1BIMUpMghjISpDBbN3zANBgkqhkiG9w0BAQsFADA/
            MSQwIgYDVQQKExtEaWdpdGFsIFNpZ25hdHVyZSBUcnVzdCBDby4xFzAVBgNVBAMT
            DkRTVCBSb290IENBIFgzMB4XDTIwMTAwNzE5MjE0MFoXDTIxMDkyOTE5MjE0MFow
            MjELMAkGA1UEBhMCVVMxFjAUBgNVBAoTDUxldCdzIEVuY3J5cHQxCzAJBgNVBAMT
            AlIzMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuwIVKMz2oJTTDxLs
            jVWSw/iC8ZmmekKIp10mqrUrucVMsa+Oa/l1yKPXD0eUFFU1V4yeqKI5GfWCPEKp
            Tm71O8Mu243AsFzzWTjn7c9p8FoLG77AlCQlh/o3cbMT5xys4Zvv2+Q7RVJFlqnB
            U840yFLuta7tj95gcOKlVKu2bQ6XpUA0ayvTvGbrZjR8+muLj1cpmfgwF126cm/7
            gcWt0oZYPRfH5wm78Sv3htzB2nFd1EbjzK0lwYi8YGd1ZrPxGPeiXOZT/zqItkel
            /xMY6pgJdz+dU/nPAeX1pnAXFK9jpP+Zs5Od3FOnBv5IhR2haa4ldbsTzFID9e1R
            oYvbFQIDAQABo4IBaDCCAWQwEgYDVR0TAQH/BAgwBgEB/wIBADAOBgNVHQ8BAf8E
            BAMCAYYwSwYIKwYBBQUHAQEEPzA9MDsGCCsGAQUFBzAChi9odHRwOi8vYXBwcy5p
            ZGVudHJ1c3QuY29tL3Jvb3RzL2RzdHJvb3RjYXgzLnA3YzAfBgNVHSMEGDAWgBTE
            p7Gkeyxx+tvhS5B1/8QVYIWJEDBUBgNVHSAETTBLMAgGBmeBDAECATA/BgsrBgEE
            AYLfEwEBATAwMC4GCCsGAQUFBwIBFiJodHRwOi8vY3BzLnJvb3QteDEubGV0c2Vu
            Y3J5cHQub3JnMDwGA1UdHwQ1MDMwMaAvoC2GK2h0dHA6Ly9jcmwuaWRlbnRydXN0
            LmNvbS9EU1RST09UQ0FYM0NSTC5jcmwwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYf
            r52LFMLGMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjANBgkqhkiG9w0B
            AQsFAAOCAQEA2UzgyfWEiDcx27sT4rP8i2tiEmxYt0l+PAK3qB8oYevO4C5z70kH
            ejWEHx2taPDY/laBL21/WKZuNTYQHHPD5b1tXgHXbnL7KqC401dk5VvCadTQsvd8
            S8MXjohyc9z9/G2948kLjmE6Flh9dDYrVYA9x2O+hEPGOaEOa1eePynBgPayvUfL
            qjBstzLhWVQLGAkXXmNs+5ZnPBxzDJOLxhF2JIbeQAcH5H0tZrUlo5ZYyOqA7s9p
            O5b85o3AM/OJ+CktFBQtfvBhcJVd9wvlwPsk+uyOy2HI7mNxKKgsBTt375teA2Tw
            UdHkhVNcsAKX1H7GNNLOEADksd86wuoXvg==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      + pre_check_delay              = 0
      ~ private_key_pem              = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.acme_certificate.certificate_fluent_labs will be updated in-place
  ~ resource "acme_certificate" "certificate_fluent_labs" {
      ~ certificate_domain           = "*.fluentlabs.io" -> (known after apply)
      ~ certificate_p12              = (sensitive value)
      ~ certificate_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFJDCCBAygAwIBAgISBCO7Do27NXXPhEqDjGGbWgPbMA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yMTAyMjUwNDQ0MzNaFw0yMTA1MjYwNDQ0MzNaMBoxGDAWBgNVBAMM
            DyouZmx1ZW50bGFicy5pbzCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEB
            AKtV6ikd5Nf4zcqXntiUzmK3KAA7U/pQ+WpNgcb+ifzEjTKzodJqgtJxzKwMqRiA
            mIB1dFKEdM3LL8sJV6JFyLnZSl/i7gZ98vujDSp8YueBm6wphjps5xBRDRYArFMO
            DC9E9XZWa61fDdFSjEbtUhYhUs5sqmdzEoPty7lhEgaDm8bCDcth6VsgJiq65JbY
            bldKW+LmkCPrHHRMF+Ob/U1hHYyLAtJj1w329uyhRvE6aSeI+utqejOlwqAhdkY4
            84auqc5Ii+TsEmudb8/GBMMwNDPGTYrBgo1IVDth1bj+eELiNQT74yt5Dj9cEnvl
            u/bSr4R1Gwh5up8d26xjewkCAwEAAaOCAkowggJGMA4GA1UdDwEB/wQEAwIFoDAd
            BgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIwADAdBgNV
            HQ4EFgQUdbcIvWxRYNKNwG72RunUK7jac9QwHwYDVR0jBBgwFoAUFC6zF7dYVsuu
            UAlA5h+vnYsUwsYwVQYIKwYBBQUHAQEESTBHMCEGCCsGAQUFBzABhhVodHRwOi8v
            cjMuby5sZW5jci5vcmcwIgYIKwYBBQUHMAKGFmh0dHA6Ly9yMy5pLmxlbmNyLm9y
            Zy8wGgYDVR0RBBMwEYIPKi5mbHVlbnRsYWJzLmlvMEwGA1UdIARFMEMwCAYGZ4EM
            AQIBMDcGCysGAQQBgt8TAQEBMCgwJgYIKwYBBQUHAgEWGmh0dHA6Ly9jcHMubGV0
            c2VuY3J5cHQub3JnMIIBBAYKKwYBBAHWeQIEAgSB9QSB8gDwAHYAXNxDkv7mq0VE
            sV6a1FbmEDf71fpH3KFzlLJe5vbHDsoAAAF317enxwAABAMARzBFAiBv5/9SRAAw
            HVzp2Z6hR4Di7ZfAv68rwQ3mDIDBEopiegIhAN77hP9C9JyfL9MDUdBcc3LH/7bR
            KZyzPBH4TaChTo+dAHYA9lyUL9F3MCIUVBgIMJRWjuNNExkzv98MLyALzE7xZOMA
            AAF317ensgAABAMARzBFAiEAl1r7NIfRXj/Q6E9FBiXSTso0GWvyL8gJyIp7TOg6
            bqgCIErBjbb+hF8UtvOg4heovLhjNugPzljTXRGCNWjRSFMfMA0GCSqGSIb3DQEB
            CwUAA4IBAQBhew1SK9FWWAHfDQ5RtGR02E6hR31XvlC4NLqPYTDLIZ2iSpAEUBIn
            gwWe4/TKA4S5m29V6xh5MrTc2osoLe88wG/VGXf5EVNV8SDNPhMnu0qUvZW16WtG
            qsRe4mIfmM9hHAggt/9f+aJytY+NsK1bm9NY5B5Rdpxzpgqt4QG/lP/Va+lFMxe4
            EIBm3PBMlXC+QSfkwwukRE7qrQlSUKPynu+sqZz6Jlc2rMiUhXG+GdR+4T2PsouB
            xWMV5UUhjsPy5e6CO0qDsN7nfk08DRl7HPCpvgVbb9znSO/SDn8ejClbe+MeHRa1
            F1NjgVhrSPiz1LdSbNKn3Pq35u9K9Pzd
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ certificate_url              = "https://acme-v02.api.letsencrypt.org/acme/cert/0423bb0e8dbb3575cf844a838c619b5a03db" -> (known after apply)
        id                           = "5a8b4843-0d50-0f47-e2db-9a7d0d0d208a"
      ~ issuer_pem                   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEZTCCA02gAwIBAgIQQAF1BIMUpMghjISpDBbN3zANBgkqhkiG9w0BAQsFADA/
            MSQwIgYDVQQKExtEaWdpdGFsIFNpZ25hdHVyZSBUcnVzdCBDby4xFzAVBgNVBAMT
            DkRTVCBSb290IENBIFgzMB4XDTIwMTAwNzE5MjE0MFoXDTIxMDkyOTE5MjE0MFow
            MjELMAkGA1UEBhMCVVMxFjAUBgNVBAoTDUxldCdzIEVuY3J5cHQxCzAJBgNVBAMT
            AlIzMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuwIVKMz2oJTTDxLs
            jVWSw/iC8ZmmekKIp10mqrUrucVMsa+Oa/l1yKPXD0eUFFU1V4yeqKI5GfWCPEKp
            Tm71O8Mu243AsFzzWTjn7c9p8FoLG77AlCQlh/o3cbMT5xys4Zvv2+Q7RVJFlqnB
            U840yFLuta7tj95gcOKlVKu2bQ6XpUA0ayvTvGbrZjR8+muLj1cpmfgwF126cm/7
            gcWt0oZYPRfH5wm78Sv3htzB2nFd1EbjzK0lwYi8YGd1ZrPxGPeiXOZT/zqItkel
            /xMY6pgJdz+dU/nPAeX1pnAXFK9jpP+Zs5Od3FOnBv5IhR2haa4ldbsTzFID9e1R
            oYvbFQIDAQABo4IBaDCCAWQwEgYDVR0TAQH/BAgwBgEB/wIBADAOBgNVHQ8BAf8E
            BAMCAYYwSwYIKwYBBQUHAQEEPzA9MDsGCCsGAQUFBzAChi9odHRwOi8vYXBwcy5p
            ZGVudHJ1c3QuY29tL3Jvb3RzL2RzdHJvb3RjYXgzLnA3YzAfBgNVHSMEGDAWgBTE
            p7Gkeyxx+tvhS5B1/8QVYIWJEDBUBgNVHSAETTBLMAgGBmeBDAECATA/BgsrBgEE
            AYLfEwEBATAwMC4GCCsGAQUFBwIBFiJodHRwOi8vY3BzLnJvb3QteDEubGV0c2Vu
            Y3J5cHQub3JnMDwGA1UdHwQ1MDMwMaAvoC2GK2h0dHA6Ly9jcmwuaWRlbnRydXN0
            LmNvbS9EU1RST09UQ0FYM0NSTC5jcmwwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYf
            r52LFMLGMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjANBgkqhkiG9w0B
            AQsFAAOCAQEA2UzgyfWEiDcx27sT4rP8i2tiEmxYt0l+PAK3qB8oYevO4C5z70kH
            ejWEHx2taPDY/laBL21/WKZuNTYQHHPD5b1tXgHXbnL7KqC401dk5VvCadTQsvd8
            S8MXjohyc9z9/G2948kLjmE6Flh9dDYrVYA9x2O+hEPGOaEOa1eePynBgPayvUfL
            qjBstzLhWVQLGAkXXmNs+5ZnPBxzDJOLxhF2JIbeQAcH5H0tZrUlo5ZYyOqA7s9p
            O5b85o3AM/OJ+CktFBQtfvBhcJVd9wvlwPsk+uyOy2HI7mNxKKgsBTt375teA2Tw
            UdHkhVNcsAKX1H7GNNLOEADksd86wuoXvg==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      + pre_check_delay              = 0
      ~ private_key_pem              = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + certificate_chain         = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + private_key               = (sensitive value)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.infrastructure.module.api.kubernetes_deployment.api will be updated in-place
  ~ resource "kubernetes_deployment" "api" {
        id               = "default/api"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                  ~ automount_service_account_token  = false -> true
                    # (10 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.api.kubernetes_service.api will be updated in-place
  ~ resource "kubernetes_service" "api" {
        id                     = "default/api"
      + wait_for_load_balancer = true
        # (1 unchanged attribute hidden)


        # (2 unchanged blocks hidden)
    }

  # module.infrastructure.module.content.helm_release.spark will be created
  + resource "helm_release" "spark" {
      + atomic                     = false
      + chart                      = "spark-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "spark"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://googlecloudplatform.github.io/spark-on-k8s-operator"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                webhook:
                  enable: true
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.infrastructure.module.content.kubernetes_service_account.prefect_agent will be updated in-place
  ~ resource "kubernetes_service_account" "prefect_agent" {
      ~ automount_service_account_token = false -> true
        id                              = "default/prefect-agent"
        # (1 unchanged attribute hidden)


        # (2 unchanged blocks hidden)
    }

  # module.infrastructure.module.elasticsearch.digitalocean_record.elastic_subdomain_dns will be destroyed
  - resource "digitalocean_record" "elastic_subdomain_dns" {
      - domain   = "fluentlabs.io" -> null
      - flags    = 0 -> null
      - fqdn     = "elastic.fluentlabs.io" -> null
      - id       = "138795790" -> null
      - name     = "elastic" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.197.239.135" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns will be destroyed
  - resource "digitalocean_record" "kibana_subdomain_dns" {
      - domain   = "fluentlabs.io" -> null
      - flags    = 0 -> null
      - fqdn     = "kibana.fluentlabs.io" -> null
      - id       = "138795789" -> null
      - name     = "kibana" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "138.68.36.15" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd will be updated in-place
  ~ resource "elasticsearch_index_template" "fluentd" {
        id       = "fluentd"
        name     = "fluentd"
      ~ template = jsonencode(
          ~ {
              - fluentd        = {
                  - aliases        = {}
                  - index_patterns = [
                      - "logstash-*",
                    ]
                  - mappings       = {}
                  - order          = 0
                  - settings       = {
                      - index = {
                          - lifecycle = {
                              - name           = "logging-rollover"
                              - rollover_alias = "logstash-backup-alias"
                            }
                        }
                    }
                } -> null
              + index_patterns = [
                  + "logstash-*",
                ]
              + settings       = {
                  + index.lifecycle.name           = "logging-rollover"
                  + index.lifecycle.rollover_alias = "logstash-backup-alias"
                }
            }
        )
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service will be updated in-place
  ~ resource "kubernetes_deployment" "language_service" {
        id               = "default/language-service"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                  ~ automount_service_account_token  = false -> true
                    # (10 unchanged attributes hidden)


                    # (2 unchanged blocks hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.language_service.kubernetes_service.language_service will be updated in-place
  ~ resource "kubernetes_service" "language_service" {
        id                     = "default/language-service"
      + wait_for_load_balancer = true
        # (1 unchanged attribute hidden)


        # (2 unchanged blocks hidden)
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      ~ id     = "default/nginx-ingress-nginx-ingress" -> (known after apply)
      ~ spec   = [
          - {
              - cluster_ip                  = "10.245.179.1"
              - external_ips                = []
              - external_name               = ""
              - external_traffic_policy     = "Local"
              - health_check_node_port      = 30696
              - load_balancer_ip            = ""
              - load_balancer_source_ranges = []
              - port                        = [
                  - {
                      - name        = "http"
                      - node_port   = 32728
                      - port        = 80
                      - protocol    = "TCP"
                      - target_port = "80"
                    },
                  - {
                      - name        = "https"
                      - node_port   = 30763
                      - port        = 443
                      - protocol    = "TCP"
                      - target_port = "443"
                    },
                ]
              - publish_not_ready_addresses = false
              - selector                    = {
                  - "app" = "nginx-ingress-nginx-ingress"
                }
              - session_affinity            = "None"
              - type                        = "LoadBalancer"
            },
        ] -> (known after apply)
      + status = (known after apply)

      ~ metadata {
          - annotations      = {
              - "kubernetes.digitalocean.com/load-balancer-id" = "fd4753a2-359a-40d6-b9df-682beb1a1877"
              - "meta.helm.sh/release-name"                    = "nginx-ingress"
              - "meta.helm.sh/release-namespace"               = "default"
            } -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {
              - "helm.sh/chart" = "nginx-ingress-0.7.1"
            } -> null
            name             = "nginx-ingress-nginx-ingress"
          ~ resource_version = "2358536" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/default/services/nginx-ingress-nginx-ingress" -> (known after apply)
          ~ uid              = "e0715062-0c45-4276-b6b8-5ee11c0d4d35" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"] will be destroyed
  - resource "digitalocean_record" "kubernetes_subdomain_dns" {
      - domain   = "fluentlabs.io" -> null
      - flags    = 0 -> null
      - fqdn     = "api.fluentlabs.io" -> null
      - id       = "138795791" -> null
      - name     = "api" -> null
      - port     = 0 -> null
      - priority = 0 -> null
      - ttl      = 1800 -> null
      - type     = "A" -> null
      - value    = "159.89.223.61" -> null
      - weight   = 0 -> null
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be updated in-place
  ~ resource "kubernetes_secret" "nginx_certificate" {
      ~ data = (sensitive value)
        id   = "default/nginx-certificate"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 10 to change, 3 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
